templateCase/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// epsilon [m2/s3]
dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 0.1;

boundaryField
{
    // These entries will be rebuilt from the mesh by the GUI helper.
    // Typical wall BC for k–epsilon:
    //   type epsilonWallFunction; value uniform 0;

    inlet       { type fixedValue;   value uniform 0.1; }
    outlet      { type zeroGradient; }
    walls       { type epsilonWallFunction; value uniform 0; }
}
// ************************************************************************* //
