templateCase/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// k [m2/s2]
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.01;

boundaryField
{
    // Rebuilt from mesh by the GUI.
    // Typical wall BC:
    //   type kqRWallFunction; value uniform 0;

    inlet       { type fixedValue; value uniform 0.01; }
    outlet      { type zeroGradient; }
    walls       { type kqRWallFunction; value uniform 0; }
}
// ************************************************************************* //
