templateCase/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// nuTilda [m2/s]
dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 1e-5;

boundaryField
{
    // Rebuilt from mesh by the GUI.
    inlet       { type fixedValue;   value uniform 1e-5; }
    outlet      { type zeroGradient; }
    walls       { type zeroGradient; }
}
// ************************************************************************* //
