templateCase/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// omega [1/s]
dimensions      [0 0 -1 0 0 0 0];
internalField   uniform 100;

boundaryField
{
    // Rebuilt from mesh by the GUI.
    // Typical wall BC:
    //   type omegaWallFunction; value uniform 1;

    inlet       { type fixedValue;   value uniform 100; }
    outlet      { type zeroGradient; }
    walls       { type omegaWallFunction; value uniform 1; }
}
// ************************************************************************* //
