templateCase/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2412                                  |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Kinematic pressure [m^2/s^2] for incompressible solvers
dimensions      [0 2 -2 0 0 0 0];

// A zero initial value is standard for incompressible cases.
// (It corresponds to pressure divided by density.)
internalField   uniform 0;

boundaryField
{
    // Patches will be rebuilt/overwritten by the GUI helper from the mesh.
    // Example for an outlet:
    // outlet
    // {
    //     type            zeroGradient;
    // }
}

// ************************************************************************* //
